<details>
<summary>Execution result of "plan --all --no-color" in "./live"</summary>

```terraform
07:03:47.939 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./membership

Group 2
- Module ./repository

Group 3
- Module ./organization


07:03:48.288 STDOUT [membership] tofu: OpenTofu used the selected providers to generate the following execution
07:03:48.288 STDOUT [membership] tofu: plan. Resource actions are indicated with the following symbols:
07:03:48.288 STDOUT [membership] tofu:   + create
07:03:48.288 STDOUT [membership] tofu: OpenTofu will perform the following actions:
07:03:48.288 STDOUT [membership] tofu:   # github_membership.all["reinhud"] will be created
07:03:48.288 STDOUT [membership] tofu:   + resource "github_membership" "all" {
07:03:48.288 STDOUT [membership] tofu:       + downgrade_on_destroy = false
07:03:48.288 STDOUT [membership] tofu:       + etag                 = (known after apply)
07:03:48.288 STDOUT [membership] tofu:       + id                   = (known after apply)
07:03:48.288 STDOUT [membership] tofu:       + role                 = "admin"
07:03:48.288 STDOUT [membership] tofu:       + username             = "reinhud"
07:03:48.288 STDOUT [membership] tofu:     }
07:03:48.288 STDOUT [membership] tofu:   # github_team.all["admin"] will be created
07:03:48.288 STDOUT [membership] tofu:   + resource "github_team" "all" {
07:03:48.288 STDOUT [membership] tofu:       + create_default_maintainer = false
07:03:48.288 STDOUT [membership] tofu:       + description               = "Organization wide access, manages day to day organization management"
07:03:48.288 STDOUT [membership] tofu:       + etag                      = (known after apply)
07:03:48.289 STDOUT [membership] tofu:       + id                        = (known after apply)
07:03:48.289 STDOUT [membership] tofu:       + members_count             = (known after apply)
07:03:48.289 STDOUT [membership] tofu:       + name                      = "admin"
07:03:48.289 STDOUT [membership] tofu:       + node_id                   = (known after apply)
07:03:48.289 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)
07:03:48.289 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)
07:03:48.289 STDOUT [membership] tofu:       + privacy                   = "closed"
07:03:48.289 STDOUT [membership] tofu:       + slug                      = (known after apply)
07:03:48.289 STDOUT [membership] tofu:     }
07:03:48.289 STDOUT [membership] tofu:   # github_team.all["ai"] will be created
07:03:48.289 STDOUT [membership] tofu:   + resource "github_team" "all" {
07:03:48.289 STDOUT [membership] tofu:       + create_default_maintainer = false
07:03:48.289 STDOUT [membership] tofu:       + description               = "AI/ML engineering team"
07:03:48.289 STDOUT [membership] tofu:       + etag                      = (known after apply)
07:03:48.289 STDOUT [membership] tofu:       + id                        = (known after apply)
07:03:48.289 STDOUT [membership] tofu:       + members_count             = (known after apply)
07:03:48.289 STDOUT [membership] tofu:       + name                      = "ai"
07:03:48.289 STDOUT [membership] tofu:       + node_id                   = (known after apply)
07:03:48.289 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)
07:03:48.289 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)
07:03:48.289 STDOUT [membership] tofu:       + privacy                   = "closed"
07:03:48.289 STDOUT [membership] tofu:       + slug                      = (known after apply)
07:03:48.290 STDOUT [membership] tofu:     }
07:03:48.290 STDOUT [membership] tofu:   # github_team.all["app"] will be created
07:03:48.290 STDOUT [membership] tofu:   + resource "github_team" "all" {
07:03:48.290 STDOUT [membership] tofu:       + create_default_maintainer = false
07:03:48.290 STDOUT [membership] tofu:       + description               = "Application development team"
07:03:48.290 STDOUT [membership] tofu:       + etag                      = (known after apply)
07:03:48.290 STDOUT [membership] tofu:       + id                        = (known after apply)
07:03:48.290 STDOUT [membership] tofu:       + members_count             = (known after apply)
07:03:48.290 STDOUT [membership] tofu:       + name                      = "app"
07:03:48.290 STDOUT [membership] tofu:       + node_id                   = (known after apply)
07:03:48.290 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)
07:03:48.290 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)
07:03:48.290 STDOUT [membership] tofu:       + privacy                   = "closed"
07:03:48.290 STDOUT [membership] tofu:       + slug                      = (known after apply)
07:03:48.290 STDOUT [membership] tofu:     }
07:03:48.290 STDOUT [membership] tofu:   # github_team.all["platform"] will be created
07:03:48.290 STDOUT [membership] tofu:   + resource "github_team" "all" {
07:03:48.290 STDOUT [membership] tofu:       + create_default_maintainer = false
07:03:48.290 STDOUT [membership] tofu:       + description               = "Platform engineering and infrastructure team"
07:03:48.290 STDOUT [membership] tofu:       + etag                      = (known after apply)
07:03:48.290 STDOUT [membership] tofu:       + id                        = (known after apply)
07:03:48.290 STDOUT [membership] tofu:       + members_count             = (known after apply)
07:03:48.291 STDOUT [membership] tofu:       + name                      = "platform"
07:03:48.291 STDOUT [membership] tofu:       + node_id                   = (known after apply)
07:03:48.291 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)
07:03:48.291 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)
07:03:48.291 STDOUT [membership] tofu:       + privacy                   = "closed"
07:03:48.291 STDOUT [membership] tofu:       + slug                      = (known after apply)
07:03:48.291 STDOUT [membership] tofu:     }
07:03:48.291 STDOUT [membership] tofu:   # github_team_membership.members["admin:reinhud"] will be created
07:03:48.291 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {
07:03:48.291 STDOUT [membership] tofu:       + etag     = (known after apply)
07:03:48.291 STDOUT [membership] tofu:       + id       = (known after apply)
07:03:48.291 STDOUT [membership] tofu:       + role     = "maintainer"
07:03:48.291 STDOUT [membership] tofu:       + team_id  = (known after apply)
07:03:48.291 STDOUT [membership] tofu:       + username = "reinhud"
07:03:48.291 STDOUT [membership] tofu:     }
07:03:48.291 STDOUT [membership] tofu:   # github_team_membership.members["ai:reinhud"] will be created
07:03:48.291 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {
07:03:48.291 STDOUT [membership] tofu:       + etag     = (known after apply)
07:03:48.291 STDOUT [membership] tofu:       + id       = (known after apply)
07:03:48.291 STDOUT [membership] tofu:       + role     = "maintainer"
07:03:48.291 STDOUT [membership] tofu:       + team_id  = (known after apply)
07:03:48.291 STDOUT [membership] tofu:       + username = "reinhud"
07:03:48.291 STDOUT [membership] tofu:     }
07:03:48.291 STDOUT [membership] tofu:   # github_team_membership.members["app:reinhud"] will be created
07:03:48.291 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {
07:03:48.292 STDOUT [membership] tofu:       + etag     = (known after apply)
07:03:48.292 STDOUT [membership] tofu:       + id       = (known after apply)
07:03:48.292 STDOUT [membership] tofu:       + role     = "maintainer"
07:03:48.292 STDOUT [membership] tofu:       + team_id  = (known after apply)
07:03:48.292 STDOUT [membership] tofu:       + username = "reinhud"
07:03:48.292 STDOUT [membership] tofu:     }
07:03:48.292 STDOUT [membership] tofu:   # github_team_membership.members["platform:reinhud"] will be created
07:03:48.292 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {
07:03:48.292 STDOUT [membership] tofu:       + etag     = (known after apply)
07:03:48.292 STDOUT [membership] tofu:       + id       = (known after apply)
07:03:48.292 STDOUT [membership] tofu:       + role     = "maintainer"
07:03:48.292 STDOUT [membership] tofu:       + team_id  = (known after apply)
07:03:48.292 STDOUT [membership] tofu:       + username = "reinhud"
07:03:48.292 STDOUT [membership] tofu:     }
07:03:48.292 STDOUT [membership] tofu: Plan: 9 to add, 0 to change, 0 to destroy.
07:03:48.292 STDOUT [membership] tofu: Changes to Outputs:
07:03:48.292 STDOUT [membership] tofu:   + organization_members = {
07:03:48.292 STDOUT [membership] tofu:       + reinhud = {
07:03:48.292 STDOUT [membership] tofu:           + role     = "admin"
07:03:48.292 STDOUT [membership] tofu:           + username = "reinhud"
07:03:48.292 STDOUT [membership] tofu:         }
07:03:48.292 STDOUT [membership] tofu:     }
07:03:48.292 STDOUT [membership] tofu:   + team_memberships     = {
07:03:48.292 STDOUT [membership] tofu:       + "admin:reinhud"    = {
07:03:48.292 STDOUT [membership] tofu:           + role     = "maintainer"
07:03:48.292 STDOUT [membership] tofu:           + team_id  = (known after apply)
07:03:48.292 STDOUT [membership] tofu:           + username = "reinhud"
07:03:48.292 STDOUT [membership] tofu:         }
07:03:48.292 STDOUT [membership] tofu:       + "ai:reinhud"       = {
07:03:48.292 STDOUT [membership] tofu:           + role     = "maintainer"
07:03:48.292 STDOUT [membership] tofu:           + team_id  = (known after apply)
07:03:48.292 STDOUT [membership] tofu:           + username = "reinhud"
07:03:48.293 STDOUT [membership] tofu:         }
07:03:48.293 STDOUT [membership] tofu:       + "app:reinhud"      = {
07:03:48.293 STDOUT [membership] tofu:           + role     = "maintainer"
07:03:48.293 STDOUT [membership] tofu:           + team_id  = (known after apply)
07:03:48.293 STDOUT [membership] tofu:           + username = "reinhud"
07:03:48.293 STDOUT [membership] tofu:         }
07:03:48.293 STDOUT [membership] tofu:       + "platform:reinhud" = {
07:03:48.293 STDOUT [membership] tofu:           + role     = "maintainer"
07:03:48.293 STDOUT [membership] tofu:           + team_id  = (known after apply)
07:03:48.293 STDOUT [membership] tofu:           + username = "reinhud"
07:03:48.293 STDOUT [membership] tofu:         }
07:03:48.293 STDOUT [membership] tofu:     }
07:03:48.293 STDOUT [membership] tofu:   + teams                = {
07:03:48.293 STDOUT [membership] tofu:       + admin    = {
07:03:48.293 STDOUT [membership] tofu:           + description   = "Organization wide access, manages day to day organization management"
07:03:48.293 STDOUT [membership] tofu:           + id            = (known after apply)
07:03:48.293 STDOUT [membership] tofu:           + members_count = (known after apply)
07:03:48.293 STDOUT [membership] tofu:           + name          = "admin"
07:03:48.293 STDOUT [membership] tofu:           + node_id       = (known after apply)
07:03:48.293 STDOUT [membership] tofu:           + privacy       = "closed"
07:03:48.293 STDOUT [membership] tofu:           + slug          = (known after apply)
07:03:48.293 STDOUT [membership] tofu:         }
07:03:48.293 STDOUT [membership] tofu:       + ai       = {
07:03:48.293 STDOUT [membership] tofu:           + description   = "AI/ML engineering team"
07:03:48.293 STDOUT [membership] tofu:           + id            = (known after apply)
07:03:48.293 STDOUT [membership] tofu:           + members_count = (known after apply)
07:03:48.293 STDOUT [membership] tofu:           + name          = "ai"
07:03:48.293 STDOUT [membership] tofu:           + node_id       = (known after apply)
07:03:48.293 STDOUT [membership] tofu:           + privacy       = "closed"
07:03:48.293 STDOUT [membership] tofu:           + slug          = (known after apply)
07:03:48.294 STDOUT [membership] tofu:         }
07:03:48.294 STDOUT [membership] tofu:       + app      = {
07:03:48.294 STDOUT [membership] tofu:           + description   = "Application development team"
07:03:48.294 STDOUT [membership] tofu:           + id            = (known after apply)
07:03:48.294 STDOUT [membership] tofu:           + members_count = (known after apply)
07:03:48.294 STDOUT [membership] tofu:           + name          = "app"
07:03:48.294 STDOUT [membership] tofu:           + node_id       = (known after apply)
07:03:48.294 STDOUT [membership] tofu:           + privacy       = "closed"
07:03:48.294 STDOUT [membership] tofu:           + slug          = (known after apply)
07:03:48.294 STDOUT [membership] tofu:         }
07:03:48.294 STDOUT [membership] tofu:       + platform = {
07:03:48.294 STDOUT [membership] tofu:           + description   = "Platform engineering and infrastructure team"
07:03:48.294 STDOUT [membership] tofu:           + id            = (known after apply)
07:03:48.294 STDOUT [membership] tofu:           + members_count = (known after apply)
07:03:48.294 STDOUT [membership] tofu:           + name          = "platform"
07:03:48.294 STDOUT [membership] tofu:           + node_id       = (known after apply)
07:03:48.294 STDOUT [membership] tofu:           + privacy       = "closed"
07:03:48.294 STDOUT [membership] tofu:           + slug          = (known after apply)
07:03:48.294 STDOUT [membership] tofu:         }
07:03:48.294 STDOUT [membership] tofu:     }
07:03:48.353 WARN   [repository] Config ./membership/terragrunt.hcl is a dependency of ./repository/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
07:03:48.732 STDOUT [repository] tofu: OpenTofu used the selected providers to generate the following execution
07:03:48.732 STDOUT [repository] tofu: plan. Resource actions are indicated with the following symbols:
07:03:48.732 STDOUT [repository] tofu:   + create
07:03:48.732 STDOUT [repository] tofu: OpenTofu will perform the following actions:
07:03:48.732 STDOUT [repository] tofu:   # github_issue_label.all[".github:bug"] will be created
07:03:48.732 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
07:03:48.732 STDOUT [repository] tofu:       + color       = "d73a4a"
07:03:48.732 STDOUT [repository] tofu:       + description = "Something isn't working"
07:03:48.732 STDOUT [repository] tofu:       + etag        = (known after apply)
07:03:48.732 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.732 STDOUT [repository] tofu:       + name        = "bug"
07:03:48.732 STDOUT [repository] tofu:       + repository  = ".github"
07:03:48.732 STDOUT [repository] tofu:       + url         = (known after apply)
07:03:48.732 STDOUT [repository] tofu:     }
07:03:48.732 STDOUT [repository] tofu:   # github_issue_label.all[".github:stuff"] will be created
07:03:48.732 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
07:03:48.732 STDOUT [repository] tofu:       + color       = "a2eeef"
07:03:48.732 STDOUT [repository] tofu:       + description = "Stuff & Stuff"
07:03:48.733 STDOUT [repository] tofu:       + etag        = (known after apply)
07:03:48.733 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.733 STDOUT [repository] tofu:       + name        = "stuff"
07:03:48.733 STDOUT [repository] tofu:       + repository  = ".github"
07:03:48.733 STDOUT [repository] tofu:       + url         = (known after apply)
07:03:48.733 STDOUT [repository] tofu:     }
07:03:48.733 STDOUT [repository] tofu:   # github_issue_label.all["github-management:bug"] will be created
07:03:48.733 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
07:03:48.733 STDOUT [repository] tofu:       + color       = "d73a4a"
07:03:48.733 STDOUT [repository] tofu:       + description = "Something isn't working"
07:03:48.733 STDOUT [repository] tofu:       + etag        = (known after apply)
07:03:48.733 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.733 STDOUT [repository] tofu:       + name        = "bug"
07:03:48.733 STDOUT [repository] tofu:       + repository  = "github-management"
07:03:48.733 STDOUT [repository] tofu:       + url         = (known after apply)
07:03:48.733 STDOUT [repository] tofu:     }
07:03:48.733 STDOUT [repository] tofu:   # github_issue_label.all["github-management:stuff"] will be created
07:03:48.733 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
07:03:48.733 STDOUT [repository] tofu:       + color       = "a2eeef"
07:03:48.733 STDOUT [repository] tofu:       + description = "Stuff & Stuff"
07:03:48.733 STDOUT [repository] tofu:       + etag        = (known after apply)
07:03:48.733 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.733 STDOUT [repository] tofu:       + name        = "stuff"
07:03:48.733 STDOUT [repository] tofu:       + repository  = "github-management"
07:03:48.733 STDOUT [repository] tofu:       + url         = (known after apply)
07:03:48.733 STDOUT [repository] tofu:     }
07:03:48.733 STDOUT [repository] tofu:   # github_issue_label.all["gitops:bug"] will be created
07:03:48.733 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
07:03:48.734 STDOUT [repository] tofu:       + color       = "d73a4a"
07:03:48.734 STDOUT [repository] tofu:       + description = "Something isn't working"
07:03:48.734 STDOUT [repository] tofu:       + etag        = (known after apply)
07:03:48.734 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.734 STDOUT [repository] tofu:       + name        = "bug"
07:03:48.734 STDOUT [repository] tofu:       + repository  = "gitops"
07:03:48.734 STDOUT [repository] tofu:       + url         = (known after apply)
07:03:48.734 STDOUT [repository] tofu:     }
07:03:48.734 STDOUT [repository] tofu:   # github_issue_label.all["gitops:stuff"] will be created
07:03:48.734 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
07:03:48.734 STDOUT [repository] tofu:       + color       = "a2eeef"
07:03:48.734 STDOUT [repository] tofu:       + description = "Stuff & Stuff"
07:03:48.734 STDOUT [repository] tofu:       + etag        = (known after apply)
07:03:48.734 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.734 STDOUT [repository] tofu:       + name        = "stuff"
07:03:48.734 STDOUT [repository] tofu:       + repository  = "gitops"
07:03:48.734 STDOUT [repository] tofu:       + url         = (known after apply)
07:03:48.734 STDOUT [repository] tofu:     }
07:03:48.734 STDOUT [repository] tofu:   # github_issue_label.all["infra-live:bug"] will be created
07:03:48.734 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
07:03:48.734 STDOUT [repository] tofu:       + color       = "d73a4a"
07:03:48.734 STDOUT [repository] tofu:       + description = "Something isn't working"
07:03:48.734 STDOUT [repository] tofu:       + etag        = (known after apply)
07:03:48.734 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.734 STDOUT [repository] tofu:       + name        = "bug"
07:03:48.734 STDOUT [repository] tofu:       + repository  = "infra-live"
07:03:48.734 STDOUT [repository] tofu:       + url         = (known after apply)
07:03:48.735 STDOUT [repository] tofu:     }
07:03:48.735 STDOUT [repository] tofu:   # github_issue_label.all["infra-live:stuff"] will be created
07:03:48.735 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
07:03:48.735 STDOUT [repository] tofu:       + color       = "a2eeef"
07:03:48.735 STDOUT [repository] tofu:       + description = "Stuff & Stuff"
07:03:48.735 STDOUT [repository] tofu:       + etag        = (known after apply)
07:03:48.735 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.735 STDOUT [repository] tofu:       + name        = "stuff"
07:03:48.735 STDOUT [repository] tofu:       + repository  = "infra-live"
07:03:48.735 STDOUT [repository] tofu:       + url         = (known after apply)
07:03:48.735 STDOUT [repository] tofu:     }
07:03:48.735 STDOUT [repository] tofu:   # github_issue_label.all["infra-modules:bug"] will be created
07:03:48.735 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
07:03:48.735 STDOUT [repository] tofu:       + color       = "d73a4a"
07:03:48.735 STDOUT [repository] tofu:       + description = "Something isn't working"
07:03:48.735 STDOUT [repository] tofu:       + etag        = (known after apply)
07:03:48.735 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.735 STDOUT [repository] tofu:       + name        = "bug"
07:03:48.735 STDOUT [repository] tofu:       + repository  = "infra-modules"
07:03:48.735 STDOUT [repository] tofu:       + url         = (known after apply)
07:03:48.735 STDOUT [repository] tofu:     }
07:03:48.735 STDOUT [repository] tofu:   # github_issue_label.all["infra-modules:stuff"] will be created
07:03:48.735 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
07:03:48.735 STDOUT [repository] tofu:       + color       = "a2eeef"
07:03:48.735 STDOUT [repository] tofu:       + description = "Stuff & Stuff"
07:03:48.735 STDOUT [repository] tofu:       + etag        = (known after apply)
07:03:48.736 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.736 STDOUT [repository] tofu:       + name        = "stuff"
07:03:48.736 STDOUT [repository] tofu:       + repository  = "infra-modules"
07:03:48.736 STDOUT [repository] tofu:       + url         = (known after apply)
07:03:48.736 STDOUT [repository] tofu:     }
07:03:48.736 STDOUT [repository] tofu:   # github_repository.all[".github"] will be created
07:03:48.736 STDOUT [repository] tofu:   + resource "github_repository" "all" {
07:03:48.736 STDOUT [repository] tofu:       + allow_auto_merge            = true
07:03:48.736 STDOUT [repository] tofu:       + allow_merge_commit          = true
07:03:48.736 STDOUT [repository] tofu:       + allow_rebase_merge          = true
07:03:48.736 STDOUT [repository] tofu:       + allow_squash_merge          = true
07:03:48.736 STDOUT [repository] tofu:       + allow_update_branch         = true
07:03:48.736 STDOUT [repository] tofu:       + archive_on_destroy          = false
07:03:48.736 STDOUT [repository] tofu:       + archived                    = false
07:03:48.736 STDOUT [repository] tofu:       + auto_init                   = true
07:03:48.736 STDOUT [repository] tofu:       + default_branch              = (known after apply)
07:03:48.736 STDOUT [repository] tofu:       + delete_branch_on_merge      = true
07:03:48.736 STDOUT [repository] tofu:       + description                 = "Organization-wide GitHub configurations, workflows, and community templates"
07:03:48.736 STDOUT [repository] tofu:       + etag                        = (known after apply)
07:03:48.736 STDOUT [repository] tofu:       + full_name                   = (known after apply)
07:03:48.736 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)
07:03:48.736 STDOUT [repository] tofu:       + has_discussions             = true
07:03:48.736 STDOUT [repository] tofu:       + has_downloads               = false
07:03:48.736 STDOUT [repository] tofu:       + has_issues                  = true
07:03:48.736 STDOUT [repository] tofu:       + has_projects                = false
07:03:48.736 STDOUT [repository] tofu:       + has_wiki                    = true
07:03:48.737 STDOUT [repository] tofu:       + html_url                    = (known after apply)
07:03:48.737 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)
07:03:48.737 STDOUT [repository] tofu:       + id                          = (known after apply)
07:03:48.737 STDOUT [repository] tofu:       + license_template            = "mit"
07:03:48.737 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"
07:03:48.737 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"
07:03:48.737 STDOUT [repository] tofu:       + name                        = ".github"
07:03:48.737 STDOUT [repository] tofu:       + node_id                     = (known after apply)
07:03:48.737 STDOUT [repository] tofu:       + primary_language            = (known after apply)
07:03:48.737 STDOUT [repository] tofu:       + private                     = (known after apply)
07:03:48.737 STDOUT [repository] tofu:       + repo_id                     = (known after apply)
07:03:48.737 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"
07:03:48.737 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"
07:03:48.737 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)
07:03:48.737 STDOUT [repository] tofu:       + svn_url                     = (known after apply)
07:03:48.737 STDOUT [repository] tofu:       + topics                      = [
07:03:48.737 STDOUT [repository] tofu:           + "automation",
07:03:48.737 STDOUT [repository] tofu:           + "community",
07:03:48.737 STDOUT [repository] tofu:           + "github",
07:03:48.737 STDOUT [repository] tofu:           + "templates",
07:03:48.737 STDOUT [repository] tofu:           + "workflows",
07:03:48.737 STDOUT [repository] tofu:         ]
07:03:48.737 STDOUT [repository] tofu:       + visibility                  = "public"
07:03:48.737 STDOUT [repository] tofu:       + vulnerability_alerts        = true
07:03:48.737 STDOUT [repository] tofu:       + web_commit_signoff_required = false
07:03:48.738 STDOUT [repository] tofu:       + security_and_analysis (known after apply)
07:03:48.738 STDOUT [repository] tofu:     }
07:03:48.738 STDOUT [repository] tofu:   # github_repository.all["github-management"] will be created
07:03:48.738 STDOUT [repository] tofu:   + resource "github_repository" "all" {
07:03:48.738 STDOUT [repository] tofu:       + allow_auto_merge            = false
07:03:48.738 STDOUT [repository] tofu:       + allow_merge_commit          = true
07:03:48.738 STDOUT [repository] tofu:       + allow_rebase_merge          = true
07:03:48.738 STDOUT [repository] tofu:       + allow_squash_merge          = true
07:03:48.738 STDOUT [repository] tofu:       + allow_update_branch         = true
07:03:48.738 STDOUT [repository] tofu:       + archive_on_destroy          = false
07:03:48.738 STDOUT [repository] tofu:       + archived                    = false
07:03:48.738 STDOUT [repository] tofu:       + auto_init                   = true
07:03:48.738 STDOUT [repository] tofu:       + default_branch              = (known after apply)
07:03:48.738 STDOUT [repository] tofu:       + delete_branch_on_merge      = true
07:03:48.738 STDOUT [repository] tofu:       + description                 = "Infrastructure as Code for GitHub organization, repositories, and security management"
07:03:48.738 STDOUT [repository] tofu:       + etag                        = (known after apply)
07:03:48.738 STDOUT [repository] tofu:       + full_name                   = (known after apply)
07:03:48.738 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)
07:03:48.738 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"
07:03:48.738 STDOUT [repository] tofu:       + has_discussions             = false
07:03:48.738 STDOUT [repository] tofu:       + has_downloads               = false
07:03:48.738 STDOUT [repository] tofu:       + has_issues                  = true
07:03:48.738 STDOUT [repository] tofu:       + has_projects                = false
07:03:48.738 STDOUT [repository] tofu:       + has_wiki                    = false
07:03:48.738 STDOUT [repository] tofu:       + html_url                    = (known after apply)
07:03:48.739 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)
07:03:48.739 STDOUT [repository] tofu:       + id                          = (known after apply)
07:03:48.739 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"
07:03:48.739 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"
07:03:48.739 STDOUT [repository] tofu:       + name                        = "github-management"
07:03:48.739 STDOUT [repository] tofu:       + node_id                     = (known after apply)
07:03:48.739 STDOUT [repository] tofu:       + primary_language            = (known after apply)
07:03:48.739 STDOUT [repository] tofu:       + private                     = (known after apply)
07:03:48.739 STDOUT [repository] tofu:       + repo_id                     = (known after apply)
07:03:48.739 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"
07:03:48.739 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"
07:03:48.739 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)
07:03:48.739 STDOUT [repository] tofu:       + svn_url                     = (known after apply)
07:03:48.739 STDOUT [repository] tofu:       + topics                      = [
07:03:48.739 STDOUT [repository] tofu:           + "automation",
07:03:48.739 STDOUT [repository] tofu:           + "github",
07:03:48.739 STDOUT [repository] tofu:           + "infrastructure",
07:03:48.739 STDOUT [repository] tofu:           + "security",
07:03:48.739 STDOUT [repository] tofu:           + "terraform",
07:03:48.739 STDOUT [repository] tofu:         ]
07:03:48.739 STDOUT [repository] tofu:       + visibility                  = "public"
07:03:48.739 STDOUT [repository] tofu:       + vulnerability_alerts        = true
07:03:48.739 STDOUT [repository] tofu:       + web_commit_signoff_required = false
07:03:48.739 STDOUT [repository] tofu:       + security_and_analysis (known after apply)
07:03:48.739 STDOUT [repository] tofu:     }
07:03:48.739 STDOUT [repository] tofu:   # github_repository.all["gitops"] will be created
07:03:48.740 STDOUT [repository] tofu:   + resource "github_repository" "all" {
07:03:48.740 STDOUT [repository] tofu:       + allow_auto_merge            = false
07:03:48.740 STDOUT [repository] tofu:       + allow_merge_commit          = true
07:03:48.740 STDOUT [repository] tofu:       + allow_rebase_merge          = true
07:03:48.740 STDOUT [repository] tofu:       + allow_squash_merge          = true
07:03:48.740 STDOUT [repository] tofu:       + allow_update_branch         = true
07:03:48.740 STDOUT [repository] tofu:       + archive_on_destroy          = false
07:03:48.740 STDOUT [repository] tofu:       + archived                    = false
07:03:48.740 STDOUT [repository] tofu:       + auto_init                   = true
07:03:48.740 STDOUT [repository] tofu:       + default_branch              = (known after apply)
07:03:48.740 STDOUT [repository] tofu:       + delete_branch_on_merge      = true
07:03:48.740 STDOUT [repository] tofu:       + description                 = "GitOps repository for Kubernetes application deployments using ArgoCD and Helm"
07:03:48.740 STDOUT [repository] tofu:       + etag                        = (known after apply)
07:03:48.740 STDOUT [repository] tofu:       + full_name                   = (known after apply)
07:03:48.740 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)
07:03:48.740 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"
07:03:48.740 STDOUT [repository] tofu:       + has_discussions             = false
07:03:48.740 STDOUT [repository] tofu:       + has_downloads               = false
07:03:48.740 STDOUT [repository] tofu:       + has_issues                  = true
07:03:48.740 STDOUT [repository] tofu:       + has_projects                = false
07:03:48.740 STDOUT [repository] tofu:       + has_wiki                    = false
07:03:48.740 STDOUT [repository] tofu:       + html_url                    = (known after apply)
07:03:48.741 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)
07:03:48.741 STDOUT [repository] tofu:       + id                          = (known after apply)
07:03:48.741 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"
07:03:48.741 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"
07:03:48.741 STDOUT [repository] tofu:       + name                        = "gitops"
07:03:48.741 STDOUT [repository] tofu:       + node_id                     = (known after apply)
07:03:48.741 STDOUT [repository] tofu:       + primary_language            = (known after apply)
07:03:48.741 STDOUT [repository] tofu:       + private                     = (known after apply)
07:03:48.741 STDOUT [repository] tofu:       + repo_id                     = (known after apply)
07:03:48.741 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"
07:03:48.741 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"
07:03:48.741 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)
07:03:48.741 STDOUT [repository] tofu:       + svn_url                     = (known after apply)
07:03:48.741 STDOUT [repository] tofu:       + topics                      = [
07:03:48.741 STDOUT [repository] tofu:           + "argocd",
07:03:48.741 STDOUT [repository] tofu:           + "deployments",
07:03:48.741 STDOUT [repository] tofu:           + "gitops",
07:03:48.741 STDOUT [repository] tofu:           + "helm",
07:03:48.741 STDOUT [repository] tofu:           + "kubernetes",
07:03:48.741 STDOUT [repository] tofu:         ]
07:03:48.741 STDOUT [repository] tofu:       + visibility                  = "public"
07:03:48.741 STDOUT [repository] tofu:       + vulnerability_alerts        = true
07:03:48.741 STDOUT [repository] tofu:       + web_commit_signoff_required = false
07:03:48.741 STDOUT [repository] tofu:       + security_and_analysis (known after apply)
07:03:48.741 STDOUT [repository] tofu:     }
07:03:48.741 STDOUT [repository] tofu:   # github_repository.all["infra-live"] will be created
07:03:48.742 STDOUT [repository] tofu:   + resource "github_repository" "all" {
07:03:48.742 STDOUT [repository] tofu:       + allow_auto_merge            = false
07:03:48.742 STDOUT [repository] tofu:       + allow_merge_commit          = true
07:03:48.742 STDOUT [repository] tofu:       + allow_rebase_merge          = true
07:03:48.742 STDOUT [repository] tofu:       + allow_squash_merge          = true
07:03:48.742 STDOUT [repository] tofu:       + allow_update_branch         = true
07:03:48.742 STDOUT [repository] tofu:       + archive_on_destroy          = false
07:03:48.742 STDOUT [repository] tofu:       + archived                    = false
07:03:48.742 STDOUT [repository] tofu:       + auto_init                   = true
07:03:48.742 STDOUT [repository] tofu:       + default_branch              = (known after apply)
07:03:48.742 STDOUT [repository] tofu:       + delete_branch_on_merge      = true
07:03:48.742 STDOUT [repository] tofu:       + description                 = "Live infrastructure configurations managed with Terragrunt for environment-specific deployments"
07:03:48.742 STDOUT [repository] tofu:       + etag                        = (known after apply)
07:03:48.742 STDOUT [repository] tofu:       + full_name                   = (known after apply)
07:03:48.742 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)
07:03:48.742 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"
07:03:48.742 STDOUT [repository] tofu:       + has_discussions             = false
07:03:48.742 STDOUT [repository] tofu:       + has_downloads               = false
07:03:48.742 STDOUT [repository] tofu:       + has_issues                  = true
07:03:48.742 STDOUT [repository] tofu:       + has_projects                = false
07:03:48.742 STDOUT [repository] tofu:       + has_wiki                    = false
07:03:48.742 STDOUT [repository] tofu:       + html_url                    = (known after apply)
07:03:48.742 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)
07:03:48.743 STDOUT [repository] tofu:       + id                          = (known after apply)
07:03:48.743 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"
07:03:48.743 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"
07:03:48.743 STDOUT [repository] tofu:       + name                        = "infra-live"
07:03:48.743 STDOUT [repository] tofu:       + node_id                     = (known after apply)
07:03:48.743 STDOUT [repository] tofu:       + primary_language            = (known after apply)
07:03:48.743 STDOUT [repository] tofu:       + private                     = (known after apply)
07:03:48.743 STDOUT [repository] tofu:       + repo_id                     = (known after apply)
07:03:48.743 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"
07:03:48.743 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"
07:03:48.743 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)
07:03:48.743 STDOUT [repository] tofu:       + svn_url                     = (known after apply)
07:03:48.743 STDOUT [repository] tofu:       + topics                      = [
07:03:48.743 STDOUT [repository] tofu:           + "environments",
07:03:48.743 STDOUT [repository] tofu:           + "infrastructure",
07:03:48.743 STDOUT [repository] tofu:           + "production",
07:03:48.743 STDOUT [repository] tofu:           + "terraform",
07:03:48.743 STDOUT [repository] tofu:           + "terragrunt",
07:03:48.743 STDOUT [repository] tofu:         ]
07:03:48.743 STDOUT [repository] tofu:       + visibility                  = "public"
07:03:48.743 STDOUT [repository] tofu:       + vulnerability_alerts        = true
07:03:48.743 STDOUT [repository] tofu:       + web_commit_signoff_required = false
07:03:48.743 STDOUT [repository] tofu:       + security_and_analysis (known after apply)
07:03:48.743 STDOUT [repository] tofu:     }
07:03:48.743 STDOUT [repository] tofu:   # github_repository.all["infra-modules"] will be created
07:03:48.743 STDOUT [repository] tofu:   + resource "github_repository" "all" {
07:03:48.744 STDOUT [repository] tofu:       + allow_auto_merge            = false
07:03:48.744 STDOUT [repository] tofu:       + allow_merge_commit          = true
07:03:48.744 STDOUT [repository] tofu:       + allow_rebase_merge          = true
07:03:48.744 STDOUT [repository] tofu:       + allow_squash_merge          = true
07:03:48.744 STDOUT [repository] tofu:       + allow_update_branch         = true
07:03:48.744 STDOUT [repository] tofu:       + archive_on_destroy          = false
07:03:48.744 STDOUT [repository] tofu:       + archived                    = false
07:03:48.744 STDOUT [repository] tofu:       + auto_init                   = true
07:03:48.744 STDOUT [repository] tofu:       + default_branch              = (known after apply)
07:03:48.744 STDOUT [repository] tofu:       + delete_branch_on_merge      = true
07:03:48.744 STDOUT [repository] tofu:       + description                 = "Reusable Terraform modules for cloud infrastructure and Kubernetes platform components"
07:03:48.744 STDOUT [repository] tofu:       + etag                        = (known after apply)
07:03:48.744 STDOUT [repository] tofu:       + full_name                   = (known after apply)
07:03:48.744 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)
07:03:48.744 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"
07:03:48.744 STDOUT [repository] tofu:       + has_discussions             = false
07:03:48.744 STDOUT [repository] tofu:       + has_downloads               = false
07:03:48.744 STDOUT [repository] tofu:       + has_issues                  = true
07:03:48.744 STDOUT [repository] tofu:       + has_projects                = false
07:03:48.744 STDOUT [repository] tofu:       + has_wiki                    = false
07:03:48.744 STDOUT [repository] tofu:       + html_url                    = (known after apply)
07:03:48.744 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)
07:03:48.744 STDOUT [repository] tofu:       + id                          = (known after apply)
07:03:48.745 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"
07:03:48.745 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"
07:03:48.745 STDOUT [repository] tofu:       + name                        = "infra-modules"
07:03:48.745 STDOUT [repository] tofu:       + node_id                     = (known after apply)
07:03:48.745 STDOUT [repository] tofu:       + primary_language            = (known after apply)
07:03:48.745 STDOUT [repository] tofu:       + private                     = (known after apply)
07:03:48.745 STDOUT [repository] tofu:       + repo_id                     = (known after apply)
07:03:48.745 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"
07:03:48.745 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"
07:03:48.745 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)
07:03:48.745 STDOUT [repository] tofu:       + svn_url                     = (known after apply)
07:03:48.745 STDOUT [repository] tofu:       + topics                      = [
07:03:48.745 STDOUT [repository] tofu:           + "cloud",
07:03:48.745 STDOUT [repository] tofu:           + "infrastructure",
07:03:48.745 STDOUT [repository] tofu:           + "kubernetes",
07:03:48.745 STDOUT [repository] tofu:           + "modules",
07:03:48.745 STDOUT [repository] tofu:           + "terraform",
07:03:48.745 STDOUT [repository] tofu:         ]
07:03:48.745 STDOUT [repository] tofu:       + visibility                  = "public"
07:03:48.745 STDOUT [repository] tofu:       + vulnerability_alerts        = true
07:03:48.745 STDOUT [repository] tofu:       + web_commit_signoff_required = false
07:03:48.745 STDOUT [repository] tofu:       + security_and_analysis (known after apply)
07:03:48.745 STDOUT [repository] tofu:     }
07:03:48.745 STDOUT [repository] tofu:   # github_repository_milestone.all[".github:Phase 1: Milestone 1"] will be created
07:03:48.745 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {
07:03:48.746 STDOUT [repository] tofu:       + description = "Milestone 1"
07:03:48.746 STDOUT [repository] tofu:       + due_date    = "2025-09-01"
07:03:48.746 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.746 STDOUT [repository] tofu:       + number      = (known after apply)
07:03:48.746 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"
07:03:48.746 STDOUT [repository] tofu:       + repository  = ".github"
07:03:48.746 STDOUT [repository] tofu:       + state       = "open"
07:03:48.746 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"
07:03:48.746 STDOUT [repository] tofu:     }
07:03:48.746 STDOUT [repository] tofu:   # github_repository_milestone.all["github-management:Phase 1: Milestone 1"] will be created
07:03:48.746 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {
07:03:48.746 STDOUT [repository] tofu:       + description = "Milestone 1"
07:03:48.746 STDOUT [repository] tofu:       + due_date    = "2025-09-01"
07:03:48.746 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.746 STDOUT [repository] tofu:       + number      = (known after apply)
07:03:48.746 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"
07:03:48.746 STDOUT [repository] tofu:       + repository  = "github-management"
07:03:48.746 STDOUT [repository] tofu:       + state       = "open"
07:03:48.746 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"
07:03:48.746 STDOUT [repository] tofu:     }
07:03:48.746 STDOUT [repository] tofu:   # github_repository_milestone.all["gitops:Phase 1: Milestone 1"] will be created
07:03:48.746 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {
07:03:48.746 STDOUT [repository] tofu:       + description = "Milestone 1"
07:03:48.746 STDOUT [repository] tofu:       + due_date    = "2025-09-01"
07:03:48.746 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.746 STDOUT [repository] tofu:       + number      = (known after apply)
07:03:48.746 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"
07:03:48.747 STDOUT [repository] tofu:       + repository  = "gitops"
07:03:48.747 STDOUT [repository] tofu:       + state       = "open"
07:03:48.747 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"
07:03:48.747 STDOUT [repository] tofu:     }
07:03:48.747 STDOUT [repository] tofu:   # github_repository_milestone.all["infra-live:Phase 1: Milestone 1"] will be created
07:03:48.747 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {
07:03:48.747 STDOUT [repository] tofu:       + description = "Milestone 1"
07:03:48.747 STDOUT [repository] tofu:       + due_date    = "2025-09-01"
07:03:48.747 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.747 STDOUT [repository] tofu:       + number      = (known after apply)
07:03:48.747 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"
07:03:48.747 STDOUT [repository] tofu:       + repository  = "infra-live"
07:03:48.747 STDOUT [repository] tofu:       + state       = "open"
07:03:48.747 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"
07:03:48.747 STDOUT [repository] tofu:     }
07:03:48.747 STDOUT [repository] tofu:   # github_repository_milestone.all["infra-modules:Phase 1: Milestone 1"] will be created
07:03:48.747 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {
07:03:48.747 STDOUT [repository] tofu:       + description = "Milestone 1"
07:03:48.747 STDOUT [repository] tofu:       + due_date    = "2025-09-01"
07:03:48.747 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.747 STDOUT [repository] tofu:       + number      = (known after apply)
07:03:48.747 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"
07:03:48.747 STDOUT [repository] tofu:       + repository  = "infra-modules"
07:03:48.747 STDOUT [repository] tofu:       + state       = "open"
07:03:48.747 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"
07:03:48.747 STDOUT [repository] tofu:     }
07:03:48.747 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets[".github:public-security"] will be created
07:03:48.748 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {
07:03:48.748 STDOUT [repository] tofu:       + enforcement = "active"
07:03:48.748 STDOUT [repository] tofu:       + etag        = (known after apply)
07:03:48.748 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.748 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"
07:03:48.748 STDOUT [repository] tofu:       + node_id     = (known after apply)
07:03:48.748 STDOUT [repository] tofu:       + repository  = ".github"
07:03:48.748 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)
07:03:48.748 STDOUT [repository] tofu:       + target      = "branch"
07:03:48.748 STDOUT [repository] tofu:       + bypass_actors {
07:03:48.748 STDOUT [repository] tofu:           + actor_id    = 1
07:03:48.748 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"
07:03:48.748 STDOUT [repository] tofu:           + bypass_mode = "always"
07:03:48.748 STDOUT [repository] tofu:         }
07:03:48.748 STDOUT [repository] tofu:       + bypass_actors {
07:03:48.748 STDOUT [repository] tofu:           + actor_id    = 5
07:03:48.748 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"
07:03:48.748 STDOUT [repository] tofu:           + bypass_mode = "pull_request"
07:03:48.748 STDOUT [repository] tofu:         }
07:03:48.748 STDOUT [repository] tofu:       + conditions {
07:03:48.748 STDOUT [repository] tofu:           + ref_name {
07:03:48.748 STDOUT [repository] tofu:               + exclude = []
07:03:48.748 STDOUT [repository] tofu:               + include = [
07:03:48.748 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",
07:03:48.748 STDOUT [repository] tofu:                 ]
07:03:48.748 STDOUT [repository] tofu:             }
07:03:48.748 STDOUT [repository] tofu:         }
07:03:48.748 STDOUT [repository] tofu:       + rules {
07:03:48.748 STDOUT [repository] tofu:           + creation                      = true
07:03:48.748 STDOUT [repository] tofu:           + deletion                      = true
07:03:48.748 STDOUT [repository] tofu:           + non_fast_forward              = true
07:03:48.748 STDOUT [repository] tofu:           + required_linear_history       = true
07:03:48.748 STDOUT [repository] tofu:           + required_signatures           = true
07:03:48.748 STDOUT [repository] tofu:           + update                        = true
07:03:48.748 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false
07:03:48.748 STDOUT [repository] tofu:           + branch_name_pattern {
07:03:48.748 STDOUT [repository] tofu:               + name     = "Valid Branch Names"
07:03:48.748 STDOUT [repository] tofu:               + negate   = true
07:03:48.748 STDOUT [repository] tofu:               + operator = "regex"
07:03:48.748 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"
07:03:48.748 STDOUT [repository] tofu:             }
07:03:48.748 STDOUT [repository] tofu:           + commit_message_pattern {
07:03:48.749 STDOUT [repository] tofu:               + name     = "Conventional Commits"
07:03:48.749 STDOUT [repository] tofu:               + negate   = false
07:03:48.749 STDOUT [repository] tofu:               + operator = "regex"
07:03:48.749 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\\(.+\\))?: .+"
07:03:48.749 STDOUT [repository] tofu:             }
07:03:48.749 STDOUT [repository] tofu:           + merge_queue {
07:03:48.749 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60
07:03:48.749 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"
07:03:48.749 STDOUT [repository] tofu:               + max_entries_to_build              = 5
07:03:48.749 STDOUT [repository] tofu:               + max_entries_to_merge              = 5
07:03:48.749 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"
07:03:48.749 STDOUT [repository] tofu:               + min_entries_to_merge              = 1
07:03:48.749 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5
07:03:48.749 STDOUT [repository] tofu:             }
07:03:48.749 STDOUT [repository] tofu:           + pull_request {
07:03:48.749 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true
07:03:48.749 STDOUT [repository] tofu:               + require_code_owner_review         = true
07:03:48.749 STDOUT [repository] tofu:               + require_last_push_approval        = true
07:03:48.749 STDOUT [repository] tofu:               + required_approving_review_count   = 2
07:03:48.749 STDOUT [repository] tofu:               + required_review_thread_resolution = true
07:03:48.749 STDOUT [repository] tofu:             }
07:03:48.749 STDOUT [repository] tofu:           + required_code_scanning {
07:03:48.749 STDOUT [repository] tofu:               + required_code_scanning_tool {
07:03:48.749 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"
07:03:48.749 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"
07:03:48.749 STDOUT [repository] tofu:                   + tool                      = "CodeQL"
07:03:48.749 STDOUT [repository] tofu:                 }
07:03:48.749 STDOUT [repository] tofu:             }
07:03:48.749 STDOUT [repository] tofu:           + required_status_checks {
07:03:48.749 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false
07:03:48.749 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true
07:03:48.749 STDOUT [repository] tofu:               + required_check {
07:03:48.749 STDOUT [repository] tofu:                   + context        = "Code Quality"
07:03:48.749 STDOUT [repository] tofu:                   + integration_id = 0
07:03:48.749 STDOUT [repository] tofu:                 }
07:03:48.749 STDOUT [repository] tofu:               + required_check {
07:03:48.749 STDOUT [repository] tofu:                   + context        = "Security Scan"
07:03:48.749 STDOUT [repository] tofu:                   + integration_id = 0
07:03:48.749 STDOUT [repository] tofu:                 }
07:03:48.749 STDOUT [repository] tofu:               + required_check {
07:03:48.749 STDOUT [repository] tofu:                   + context        = "Tests"
07:03:48.749 STDOUT [repository] tofu:                   + integration_id = 0
07:03:48.749 STDOUT [repository] tofu:                 }
07:03:48.749 STDOUT [repository] tofu:             }
07:03:48.749 STDOUT [repository] tofu:         }
07:03:48.749 STDOUT [repository] tofu:     }
07:03:48.749 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["github-management:public-security"] will be created
07:03:48.750 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {
07:03:48.750 STDOUT [repository] tofu:       + enforcement = "active"
07:03:48.750 STDOUT [repository] tofu:       + etag        = (known after apply)
07:03:48.750 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.750 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"
07:03:48.750 STDOUT [repository] tofu:       + node_id     = (known after apply)
07:03:48.750 STDOUT [repository] tofu:       + repository  = "github-management"
07:03:48.750 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)
07:03:48.750 STDOUT [repository] tofu:       + target      = "branch"
07:03:48.750 STDOUT [repository] tofu:       + bypass_actors {
07:03:48.750 STDOUT [repository] tofu:           + actor_id    = 1
07:03:48.750 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"
07:03:48.750 STDOUT [repository] tofu:           + bypass_mode = "always"
07:03:48.750 STDOUT [repository] tofu:         }
07:03:48.750 STDOUT [repository] tofu:       + bypass_actors {
07:03:48.750 STDOUT [repository] tofu:           + actor_id    = 5
07:03:48.750 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"
07:03:48.750 STDOUT [repository] tofu:           + bypass_mode = "pull_request"
07:03:48.750 STDOUT [repository] tofu:         }
07:03:48.750 STDOUT [repository] tofu:       + conditions {
07:03:48.750 STDOUT [repository] tofu:           + ref_name {
07:03:48.750 STDOUT [repository] tofu:               + exclude = []
07:03:48.750 STDOUT [repository] tofu:               + include = [
07:03:48.750 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",
07:03:48.750 STDOUT [repository] tofu:                 ]
07:03:48.750 STDOUT [repository] tofu:             }
07:03:48.750 STDOUT [repository] tofu:         }
07:03:48.750 STDOUT [repository] tofu:       + rules {
07:03:48.750 STDOUT [repository] tofu:           + creation                      = true
07:03:48.750 STDOUT [repository] tofu:           + deletion                      = true
07:03:48.750 STDOUT [repository] tofu:           + non_fast_forward              = true
07:03:48.750 STDOUT [repository] tofu:           + required_linear_history       = true
07:03:48.750 STDOUT [repository] tofu:           + required_signatures           = true
07:03:48.750 STDOUT [repository] tofu:           + update                        = true
07:03:48.750 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false
07:03:48.750 STDOUT [repository] tofu:           + branch_name_pattern {
07:03:48.750 STDOUT [repository] tofu:               + name     = "Valid Branch Names"
07:03:48.750 STDOUT [repository] tofu:               + negate   = true
07:03:48.750 STDOUT [repository] tofu:               + operator = "regex"
07:03:48.750 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"
07:03:48.750 STDOUT [repository] tofu:             }
07:03:48.750 STDOUT [repository] tofu:           + commit_message_pattern {
07:03:48.750 STDOUT [repository] tofu:               + name     = "Conventional Commits"
07:03:48.750 STDOUT [repository] tofu:               + negate   = false
07:03:48.750 STDOUT [repository] tofu:               + operator = "regex"
07:03:48.750 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\\(.+\\))?: .+"
07:03:48.750 STDOUT [repository] tofu:             }
07:03:48.750 STDOUT [repository] tofu:           + merge_queue {
07:03:48.750 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60
07:03:48.750 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"
07:03:48.750 STDOUT [repository] tofu:               + max_entries_to_build              = 5
07:03:48.750 STDOUT [repository] tofu:               + max_entries_to_merge              = 5
07:03:48.750 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"
07:03:48.750 STDOUT [repository] tofu:               + min_entries_to_merge              = 1
07:03:48.751 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5
07:03:48.751 STDOUT [repository] tofu:             }
07:03:48.751 STDOUT [repository] tofu:           + pull_request {
07:03:48.751 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true
07:03:48.751 STDOUT [repository] tofu:               + require_code_owner_review         = true
07:03:48.751 STDOUT [repository] tofu:               + require_last_push_approval        = true
07:03:48.751 STDOUT [repository] tofu:               + required_approving_review_count   = 2
07:03:48.751 STDOUT [repository] tofu:               + required_review_thread_resolution = true
07:03:48.751 STDOUT [repository] tofu:             }
07:03:48.751 STDOUT [repository] tofu:           + required_code_scanning {
07:03:48.751 STDOUT [repository] tofu:               + required_code_scanning_tool {
07:03:48.751 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"
07:03:48.751 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"
07:03:48.751 STDOUT [repository] tofu:                   + tool                      = "CodeQL"
07:03:48.751 STDOUT [repository] tofu:                 }
07:03:48.751 STDOUT [repository] tofu:             }
07:03:48.751 STDOUT [repository] tofu:           + required_status_checks {
07:03:48.751 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false
07:03:48.751 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true
07:03:48.751 STDOUT [repository] tofu:               + required_check {
07:03:48.751 STDOUT [repository] tofu:                   + context        = "Code Quality"
07:03:48.751 STDOUT [repository] tofu:                   + integration_id = 0
07:03:48.751 STDOUT [repository] tofu:                 }
07:03:48.751 STDOUT [repository] tofu:               + required_check {
07:03:48.751 STDOUT [repository] tofu:                   + context        = "Security Scan"
07:03:48.751 STDOUT [repository] tofu:                   + integration_id = 0
07:03:48.751 STDOUT [repository] tofu:                 }
07:03:48.751 STDOUT [repository] tofu:               + required_check {
07:03:48.751 STDOUT [repository] tofu:                   + context        = "Tests"
07:03:48.751 STDOUT [repository] tofu:                   + integration_id = 0
07:03:48.751 STDOUT [repository] tofu:                 }
07:03:48.751 STDOUT [repository] tofu:             }
07:03:48.751 STDOUT [repository] tofu:         }
07:03:48.751 STDOUT [repository] tofu:     }
07:03:48.751 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["gitops:public-security"] will be created
07:03:48.751 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {
07:03:48.751 STDOUT [repository] tofu:       + enforcement = "active"
07:03:48.751 STDOUT [repository] tofu:       + etag        = (known after apply)
07:03:48.752 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.752 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"
07:03:48.752 STDOUT [repository] tofu:       + node_id     = (known after apply)
07:03:48.752 STDOUT [repository] tofu:       + repository  = "gitops"
07:03:48.752 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)
07:03:48.752 STDOUT [repository] tofu:       + target      = "branch"
07:03:48.752 STDOUT [repository] tofu:       + bypass_actors {
07:03:48.752 STDOUT [repository] tofu:           + actor_id    = 1
07:03:48.752 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"
07:03:48.752 STDOUT [repository] tofu:           + bypass_mode = "always"
07:03:48.752 STDOUT [repository] tofu:         }
07:03:48.752 STDOUT [repository] tofu:       + bypass_actors {
07:03:48.752 STDOUT [repository] tofu:           + actor_id    = 5
07:03:48.752 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"
07:03:48.752 STDOUT [repository] tofu:           + bypass_mode = "pull_request"
07:03:48.752 STDOUT [repository] tofu:         }
07:03:48.752 STDOUT [repository] tofu:       + conditions {
07:03:48.752 STDOUT [repository] tofu:           + ref_name {
07:03:48.752 STDOUT [repository] tofu:               + exclude = []
07:03:48.752 STDOUT [repository] tofu:               + include = [
07:03:48.752 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",
07:03:48.752 STDOUT [repository] tofu:                 ]
07:03:48.752 STDOUT [repository] tofu:             }
07:03:48.752 STDOUT [repository] tofu:         }
07:03:48.752 STDOUT [repository] tofu:       + rules {
07:03:48.752 STDOUT [repository] tofu:           + creation                      = true
07:03:48.752 STDOUT [repository] tofu:           + deletion                      = true
07:03:48.752 STDOUT [repository] tofu:           + non_fast_forward              = true
07:03:48.752 STDOUT [repository] tofu:           + required_linear_history       = true
07:03:48.752 STDOUT [repository] tofu:           + required_signatures           = true
07:03:48.752 STDOUT [repository] tofu:           + update                        = true
07:03:48.752 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false
07:03:48.753 STDOUT [repository] tofu:           + branch_name_pattern {
07:03:48.753 STDOUT [repository] tofu:               + name     = "Valid Branch Names"
07:03:48.753 STDOUT [repository] tofu:               + negate   = true
07:03:48.753 STDOUT [repository] tofu:               + operator = "regex"
07:03:48.753 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"
07:03:48.753 STDOUT [repository] tofu:             }
07:03:48.753 STDOUT [repository] tofu:           + commit_message_pattern {
07:03:48.753 STDOUT [repository] tofu:               + name     = "Conventional Commits"
07:03:48.753 STDOUT [repository] tofu:               + negate   = false
07:03:48.753 STDOUT [repository] tofu:               + operator = "regex"
07:03:48.753 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\\(.+\\))?: .+"
07:03:48.753 STDOUT [repository] tofu:             }
07:03:48.753 STDOUT [repository] tofu:           + merge_queue {
07:03:48.753 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60
07:03:48.753 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"
07:03:48.753 STDOUT [repository] tofu:               + max_entries_to_build              = 5
07:03:48.753 STDOUT [repository] tofu:               + max_entries_to_merge              = 5
07:03:48.753 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"
07:03:48.753 STDOUT [repository] tofu:               + min_entries_to_merge              = 1
07:03:48.753 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5
07:03:48.753 STDOUT [repository] tofu:             }
07:03:48.753 STDOUT [repository] tofu:           + pull_request {
07:03:48.753 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true
07:03:48.753 STDOUT [repository] tofu:               + require_code_owner_review         = true
07:03:48.754 STDOUT [repository] tofu:               + require_last_push_approval        = true
07:03:48.754 STDOUT [repository] tofu:               + required_approving_review_count   = 2
07:03:48.754 STDOUT [repository] tofu:               + required_review_thread_resolution = true
07:03:48.754 STDOUT [repository] tofu:             }
07:03:48.754 STDOUT [repository] tofu:           + required_code_scanning {
07:03:48.754 STDOUT [repository] tofu:               + required_code_scanning_tool {
07:03:48.754 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"
07:03:48.754 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"
07:03:48.754 STDOUT [repository] tofu:                   + tool                      = "CodeQL"
07:03:48.754 STDOUT [repository] tofu:                 }
07:03:48.754 STDOUT [repository] tofu:             }
07:03:48.754 STDOUT [repository] tofu:           + required_status_checks {
07:03:48.754 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false
07:03:48.754 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true
07:03:48.754 STDOUT [repository] tofu:               + required_check {
07:03:48.754 STDOUT [repository] tofu:                   + context        = "Code Quality"
07:03:48.754 STDOUT [repository] tofu:                   + integration_id = 0
07:03:48.754 STDOUT [repository] tofu:                 }
07:03:48.754 STDOUT [repository] tofu:               + required_check {
07:03:48.754 STDOUT [repository] tofu:                   + context        = "Security Scan"
07:03:48.754 STDOUT [repository] tofu:                   + integration_id = 0
07:03:48.754 STDOUT [repository] tofu:                 }
07:03:48.754 STDOUT [repository] tofu:               + required_check {
07:03:48.754 STDOUT [repository] tofu:                   + context        = "Tests"
07:03:48.754 STDOUT [repository] tofu:                   + integration_id = 0
07:03:48.754 STDOUT [repository] tofu:                 }
07:03:48.755 STDOUT [repository] tofu:             }
07:03:48.755 STDOUT [repository] tofu:         }
07:03:48.755 STDOUT [repository] tofu:     }
07:03:48.755 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["infra-live:public-security"] will be created
07:03:48.755 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {
07:03:48.755 STDOUT [repository] tofu:       + enforcement = "active"
07:03:48.755 STDOUT [repository] tofu:       + etag        = (known after apply)
07:03:48.755 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.755 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"
07:03:48.755 STDOUT [repository] tofu:       + node_id     = (known after apply)
07:03:48.755 STDOUT [repository] tofu:       + repository  = "infra-live"
07:03:48.755 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)
07:03:48.755 STDOUT [repository] tofu:       + target      = "branch"
07:03:48.755 STDOUT [repository] tofu:       + bypass_actors {
07:03:48.755 STDOUT [repository] tofu:           + actor_id    = 1
07:03:48.755 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"
07:03:48.755 STDOUT [repository] tofu:           + bypass_mode = "always"
07:03:48.755 STDOUT [repository] tofu:         }
07:03:48.755 STDOUT [repository] tofu:       + bypass_actors {
07:03:48.755 STDOUT [repository] tofu:           + actor_id    = 5
07:03:48.755 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"
07:03:48.755 STDOUT [repository] tofu:           + bypass_mode = "pull_request"
07:03:48.755 STDOUT [repository] tofu:         }
07:03:48.755 STDOUT [repository] tofu:       + conditions {
07:03:48.755 STDOUT [repository] tofu:           + ref_name {
07:03:48.755 STDOUT [repository] tofu:               + exclude = []
07:03:48.755 STDOUT [repository] tofu:               + include = [
07:03:48.755 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",
07:03:48.755 STDOUT [repository] tofu:                 ]
07:03:48.755 STDOUT [repository] tofu:             }
07:03:48.755 STDOUT [repository] tofu:         }
07:03:48.756 STDOUT [repository] tofu:       + rules {
07:03:48.756 STDOUT [repository] tofu:           + creation                      = true
07:03:48.756 STDOUT [repository] tofu:           + deletion                      = true
07:03:48.756 STDOUT [repository] tofu:           + non_fast_forward              = true
07:03:48.756 STDOUT [repository] tofu:           + required_linear_history       = true
07:03:48.756 STDOUT [repository] tofu:           + required_signatures           = true
07:03:48.756 STDOUT [repository] tofu:           + update                        = true
07:03:48.756 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false
07:03:48.756 STDOUT [repository] tofu:           + branch_name_pattern {
07:03:48.756 STDOUT [repository] tofu:               + name     = "Valid Branch Names"
07:03:48.756 STDOUT [repository] tofu:               + negate   = true
07:03:48.756 STDOUT [repository] tofu:               + operator = "regex"
07:03:48.756 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"
07:03:48.756 STDOUT [repository] tofu:             }
07:03:48.756 STDOUT [repository] tofu:           + commit_message_pattern {
07:03:48.756 STDOUT [repository] tofu:               + name     = "Conventional Commits"
07:03:48.756 STDOUT [repository] tofu:               + negate   = false
07:03:48.756 STDOUT [repository] tofu:               + operator = "regex"
07:03:48.756 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\\(.+\\))?: .+"
07:03:48.756 STDOUT [repository] tofu:             }
07:03:48.756 STDOUT [repository] tofu:           + merge_queue {
07:03:48.756 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60
07:03:48.756 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"
07:03:48.756 STDOUT [repository] tofu:               + max_entries_to_build              = 5
07:03:48.756 STDOUT [repository] tofu:               + max_entries_to_merge              = 5
07:03:48.756 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"
07:03:48.757 STDOUT [repository] tofu:               + min_entries_to_merge              = 1
07:03:48.757 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5
07:03:48.757 STDOUT [repository] tofu:             }
07:03:48.757 STDOUT [repository] tofu:           + pull_request {
07:03:48.757 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true
07:03:48.757 STDOUT [repository] tofu:               + require_code_owner_review         = true
07:03:48.757 STDOUT [repository] tofu:               + require_last_push_approval        = true
07:03:48.757 STDOUT [repository] tofu:               + required_approving_review_count   = 2
07:03:48.757 STDOUT [repository] tofu:               + required_review_thread_resolution = true
07:03:48.757 STDOUT [repository] tofu:             }
07:03:48.757 STDOUT [repository] tofu:           + required_code_scanning {
07:03:48.757 STDOUT [repository] tofu:               + required_code_scanning_tool {
07:03:48.757 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"
07:03:48.757 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"
07:03:48.757 STDOUT [repository] tofu:                   + tool                      = "CodeQL"
07:03:48.757 STDOUT [repository] tofu:                 }
07:03:48.757 STDOUT [repository] tofu:             }
07:03:48.757 STDOUT [repository] tofu:           + required_status_checks {
07:03:48.757 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false
07:03:48.757 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true
07:03:48.757 STDOUT [repository] tofu:               + required_check {
07:03:48.757 STDOUT [repository] tofu:                   + context        = "Code Quality"
07:03:48.757 STDOUT [repository] tofu:                   + integration_id = 0
07:03:48.758 STDOUT [repository] tofu:                 }
07:03:48.758 STDOUT [repository] tofu:               + required_check {
07:03:48.758 STDOUT [repository] tofu:                   + context        = "Security Scan"
07:03:48.758 STDOUT [repository] tofu:                   + integration_id = 0
07:03:48.758 STDOUT [repository] tofu:                 }
07:03:48.758 STDOUT [repository] tofu:               + required_check {
07:03:48.758 STDOUT [repository] tofu:                   + context        = "Tests"
07:03:48.758 STDOUT [repository] tofu:                   + integration_id = 0
07:03:48.758 STDOUT [repository] tofu:                 }
07:03:48.758 STDOUT [repository] tofu:             }
07:03:48.758 STDOUT [repository] tofu:         }
07:03:48.758 STDOUT [repository] tofu:     }
07:03:48.758 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["infra-modules:public-security"] will be created
07:03:48.758 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {
07:03:48.758 STDOUT [repository] tofu:       + enforcement = "active"
07:03:48.758 STDOUT [repository] tofu:       + etag        = (known after apply)
07:03:48.758 STDOUT [repository] tofu:       + id          = (known after apply)
07:03:48.758 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"
07:03:48.758 STDOUT [repository] tofu:       + node_id     = (known after apply)
07:03:48.758 STDOUT [repository] tofu:       + repository  = "infra-modules"
07:03:48.758 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)
07:03:48.758 STDOUT [repository] tofu:       + target      = "branch"
07:03:48.758 STDOUT [repository] tofu:       + bypass_actors {
07:03:48.758 STDOUT [repository] tofu:           + actor_id    = 1
07:03:48.758 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"
07:03:48.758 STDOUT [repository] tofu:           + bypass_mode = "always"
07:03:48.758 STDOUT [repository] tofu:         }
07:03:48.758 STDOUT [repository] tofu:       + bypass_actors {
07:03:48.758 STDOUT [repository] tofu:           + actor_id    = 5
07:03:48.759 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"
07:03:48.759 STDOUT [repository] tofu:           + bypass_mode = "pull_request"
07:03:48.759 STDOUT [repository] tofu:         }
07:03:48.759 STDOUT [repository] tofu:       + conditions {
07:03:48.759 STDOUT [repository] tofu:           + ref_name {
07:03:48.759 STDOUT [repository] tofu:               + exclude = []
07:03:48.759 STDOUT [repository] tofu:               + include = [
07:03:48.759 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",
07:03:48.759 STDOUT [repository] tofu:                 ]
07:03:48.759 STDOUT [repository] tofu:             }
07:03:48.759 STDOUT [repository] tofu:         }
07:03:48.759 STDOUT [repository] tofu:       + rules {
07:03:48.759 STDOUT [repository] tofu:           + creation                      = true
07:03:48.759 STDOUT [repository] tofu:           + deletion                      = true
07:03:48.759 STDOUT [repository] tofu:           + non_fast_forward              = true
07:03:48.759 STDOUT [repository] tofu:           + required_linear_history       = true
07:03:48.759 STDOUT [repository] tofu:           + required_signatures           = true
07:03:48.759 STDOUT [repository] tofu:           + update                        = true
07:03:48.759 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false
07:03:48.759 STDOUT [repository] tofu:           + branch_name_pattern {
07:03:48.759 STDOUT [repository] tofu:               + name     = "Valid Branch Names"
07:03:48.759 STDOUT [repository] tofu:               + negate   = true
07:03:48.759 STDOUT [repository] tofu:               + operator = "regex"
07:03:48.759 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"
07:03:48.759 STDOUT [repository] tofu:             }
07:03:48.759 STDOUT [repository] tofu:           + commit_message_pattern {
07:03:48.759 STDOUT [repository] tofu:               + name     = "Conventional Commits"
07:03:48.759 STDOUT [repository] tofu:               + negate   = false
07:03:48.759 STDOUT [repository] tofu:               + operator = "regex"
07:03:48.760 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\\(.+\\))?: .+"
07:03:48.760 STDOUT [repository] tofu:             }
07:03:48.760 STDOUT [repository] tofu:           + merge_queue {
07:03:48.760 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60
07:03:48.760 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"
07:03:48.760 STDOUT [repository] tofu:               + max_entries_to_build              = 5
07:03:48.760 STDOUT [repository] tofu:               + max_entries_to_merge              = 5
07:03:48.760 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"
07:03:48.760 STDOUT [repository] tofu:               + min_entries_to_merge              = 1
07:03:48.760 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5
07:03:48.760 STDOUT [repository] tofu:             }
07:03:48.760 STDOUT [repository] tofu:           + pull_request {
07:03:48.760 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true
07:03:48.760 STDOUT [repository] tofu:               + require_code_owner_review         = true
07:03:48.760 STDOUT [repository] tofu:               + require_last_push_approval        = true
07:03:48.760 STDOUT [repository] tofu:               + required_approving_review_count   = 2
07:03:48.760 STDOUT [repository] tofu:               + required_review_thread_resolution = true
07:03:48.760 STDOUT [repository] tofu:             }
07:03:48.760 STDOUT [repository] tofu:           + required_code_scanning {
07:03:48.760 STDOUT [repository] tofu:               + required_code_scanning_tool {
07:03:48.760 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"
07:03:48.760 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"
07:03:48.760 STDOUT [repository] tofu:                   + tool                      = "CodeQL"
07:03:48.761 STDOUT [repository] tofu:                 }
07:03:48.761 STDOUT [repository] tofu:             }
07:03:48.761 STDOUT [repository] tofu:           + required_status_checks {
07:03:48.761 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false
07:03:48.761 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true
07:03:48.761 STDOUT [repository] tofu:               + required_check {
07:03:48.761 STDOUT [repository] tofu:                   + context        = "Code Quality"
07:03:48.761 STDOUT [repository] tofu:                   + integration_id = 0
07:03:48.761 STDOUT [repository] tofu:                 }
07:03:48.761 STDOUT [repository] tofu:               + required_check {
07:03:48.761 STDOUT [repository] tofu:                   + context        = "Security Scan"
07:03:48.761 STDOUT [repository] tofu:                   + integration_id = 0
07:03:48.761 STDOUT [repository] tofu:                 }
07:03:48.761 STDOUT [repository] tofu:               + required_check {
07:03:48.761 STDOUT [repository] tofu:                   + context        = "Tests"
07:03:48.761 STDOUT [repository] tofu:                   + integration_id = 0
07:03:48.761 STDOUT [repository] tofu:                 }
07:03:48.761 STDOUT [repository] tofu:             }
07:03:48.761 STDOUT [repository] tofu:         }
07:03:48.761 STDOUT [repository] tofu:     }
07:03:48.761 STDOUT [repository] tofu: Plan: 25 to add, 0 to change, 0 to destroy.
07:03:48.761 STDOUT [repository] tofu: Changes to Outputs:
07:03:48.761 STDOUT [repository] tofu:   + collaborators = {}
07:03:48.761 STDOUT [repository] tofu:   + labels        = {
07:03:48.761 STDOUT [repository] tofu:       + ".github:bug"             = {
07:03:48.761 STDOUT [repository] tofu:           + color       = "d73a4a"
07:03:48.761 STDOUT [repository] tofu:           + description = "Something isn't working"
07:03:48.761 STDOUT [repository] tofu:           + name        = "bug"
07:03:48.761 STDOUT [repository] tofu:           + repository  = ".github"
07:03:48.761 STDOUT [repository] tofu:           + url         = (known after apply)
07:03:48.762 STDOUT [repository] tofu:         }
07:03:48.762 STDOUT [repository] tofu:       + ".github:stuff"           = {
07:03:48.762 STDOUT [repository] tofu:           + color       = "a2eeef"
07:03:48.762 STDOUT [repository] tofu:           + description = "Stuff & Stuff"
07:03:48.762 STDOUT [repository] tofu:           + name        = "stuff"
07:03:48.762 STDOUT [repository] tofu:           + repository  = ".github"
07:03:48.762 STDOUT [repository] tofu:           + url         = (known after apply)
07:03:48.762 STDOUT [repository] tofu:         }
07:03:48.762 STDOUT [repository] tofu:       + "github-management:bug"   = {
07:03:48.762 STDOUT [repository] tofu:           + color       = "d73a4a"
07:03:48.762 STDOUT [repository] tofu:           + description = "Something isn't working"
07:03:48.762 STDOUT [repository] tofu:           + name        = "bug"
07:03:48.762 STDOUT [repository] tofu:           + repository  = "github-management"
07:03:48.762 STDOUT [repository] tofu:           + url         = (known after apply)
07:03:48.762 STDOUT [repository] tofu:         }
07:03:48.762 STDOUT [repository] tofu:       + "github-management:stuff" = {
07:03:48.762 STDOUT [repository] tofu:           + color       = "a2eeef"
07:03:48.762 STDOUT [repository] tofu:           + description = "Stuff & Stuff"
07:03:48.762 STDOUT [repository] tofu:           + name        = "stuff"
07:03:48.762 STDOUT [repository] tofu:           + repository  = "github-management"
07:03:48.762 STDOUT [repository] tofu:           + url         = (known after apply)
07:03:48.762 STDOUT [repository] tofu:         }
07:03:48.762 STDOUT [repository] tofu:       + "gitops:bug"              = {
07:03:48.762 STDOUT [repository] tofu:           + color       = "d73a4a"
07:03:48.762 STDOUT [repository] tofu:           + description = "Something isn't working"
07:03:48.762 STDOUT [repository] tofu:           + name        = "bug"
07:03:48.762 STDOUT [repository] tofu:           + repository  = "gitops"
07:03:48.762 STDOUT [repository] tofu:           + url         = (known after apply)
07:03:48.762 STDOUT [repository] tofu:         }
07:03:48.762 STDOUT [repository] tofu:       + "gitops:stuff"            = {
07:03:48.763 STDOUT [repository] tofu:           + color       = "a2eeef"
07:03:48.763 STDOUT [repository] tofu:           + description = "Stuff & Stuff"
07:03:48.763 STDOUT [repository] tofu:           + name        = "stuff"
07:03:48.763 STDOUT [repository] tofu:           + repository  = "gitops"
07:03:48.763 STDOUT [repository] tofu:           + url         = (known after apply)
07:03:48.763 STDOUT [repository] tofu:         }
07:03:48.763 STDOUT [repository] tofu:       + "infra-live:bug"          = {
07:03:48.763 STDOUT [repository] tofu:           + color       = "d73a4a"
07:03:48.763 STDOUT [repository] tofu:           + description = "Something isn't working"
07:03:48.763 STDOUT [repository] tofu:           + name        = "bug"
07:03:48.763 STDOUT [repository] tofu:           + repository  = "infra-live"
07:03:48.763 STDOUT [repository] tofu:           + url         = (known after apply)
07:03:48.763 STDOUT [repository] tofu:         }
07:03:48.763 STDOUT [repository] tofu:       + "infra-live:stuff"        = {
07:03:48.763 STDOUT [repository] tofu:           + color       = "a2eeef"
07:03:48.763 STDOUT [repository] tofu:           + description = "Stuff & Stuff"
07:03:48.763 STDOUT [repository] tofu:           + name        = "stuff"
07:03:48.763 STDOUT [repository] tofu:           + repository  = "infra-live"
07:03:48.763 STDOUT [repository] tofu:           + url         = (known after apply)
07:03:48.763 STDOUT [repository] tofu:         }
07:03:48.763 STDOUT [repository] tofu:       + "infra-modules:bug"       = {
07:03:48.763 STDOUT [repository] tofu:           + color       = "d73a4a"
07:03:48.763 STDOUT [repository] tofu:           + description = "Something isn't working"
07:03:48.763 STDOUT [repository] tofu:           + name        = "bug"
07:03:48.763 STDOUT [repository] tofu:           + repository  = "infra-modules"
07:03:48.763 STDOUT [repository] tofu:           + url         = (known after apply)
07:03:48.763 STDOUT [repository] tofu:         }
07:03:48.763 STDOUT [repository] tofu:       + "infra-modules:stuff"     = {
07:03:48.763 STDOUT [repository] tofu:           + color       = "a2eeef"
07:03:48.763 STDOUT [repository] tofu:           + description = "Stuff & Stuff"
07:03:48.763 STDOUT [repository] tofu:           + name        = "stuff"
07:03:48.764 STDOUT [repository] tofu:           + repository  = "infra-modules"
07:03:48.764 STDOUT [repository] tofu:           + url         = (known after apply)
07:03:48.764 STDOUT [repository] tofu:         }
07:03:48.764 STDOUT [repository] tofu:     }
07:03:48.764 STDOUT [repository] tofu:   + milestones    = {
07:03:48.764 STDOUT [repository] tofu:       + ".github:Phase 1: Milestone 1"           = {
07:03:48.764 STDOUT [repository] tofu:           + description = "Milestone 1"
07:03:48.764 STDOUT [repository] tofu:           + due_date    = "2025-09-01"
07:03:48.764 STDOUT [repository] tofu:           + number      = (known after apply)
07:03:48.764 STDOUT [repository] tofu:           + repository  = ".github"
07:03:48.764 STDOUT [repository] tofu:           + state       = "open"
07:03:48.764 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"
07:03:48.764 STDOUT [repository] tofu:         }
07:03:48.764 STDOUT [repository] tofu:       + "github-management:Phase 1: Milestone 1" = {
07:03:48.764 STDOUT [repository] tofu:           + description = "Milestone 1"
07:03:48.764 STDOUT [repository] tofu:           + due_date    = "2025-09-01"
07:03:48.764 STDOUT [repository] tofu:           + number      = (known after apply)
07:03:48.764 STDOUT [repository] tofu:           + repository  = "github-management"
07:03:48.764 STDOUT [repository] tofu:           + state       = "open"
07:03:48.764 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"
07:03:48.764 STDOUT [repository] tofu:         }
07:03:48.764 STDOUT [repository] tofu:       + "gitops:Phase 1: Milestone 1"            = {
07:03:48.764 STDOUT [repository] tofu:           + description = "Milestone 1"
07:03:48.764 STDOUT [repository] tofu:           + due_date    = "2025-09-01"
07:03:48.764 STDOUT [repository] tofu:           + number      = (known after apply)
07:03:48.764 STDOUT [repository] tofu:           + repository  = "gitops"
07:03:48.764 STDOUT [repository] tofu:           + state       = "open"
07:03:48.764 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"
07:03:48.764 STDOUT [repository] tofu:         }
07:03:48.764 STDOUT [repository] tofu:       + "infra-live:Phase 1: Milestone 1"        = {
07:03:48.764 STDOUT [repository] tofu:           + description = "Milestone 1"
07:03:48.764 STDOUT [repository] tofu:           + due_date    = "2025-09-01"
07:03:48.764 STDOUT [repository] tofu:           + number      = (known after apply)
07:03:48.764 STDOUT [repository] tofu:           + repository  = "infra-live"
07:03:48.764 STDOUT [repository] tofu:           + state       = "open"
07:03:48.764 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"
07:03:48.764 STDOUT [repository] tofu:         }
07:03:48.764 STDOUT [repository] tofu:       + "infra-modules:Phase 1: Milestone 1"     = {
07:03:48.764 STDOUT [repository] tofu:           + description = "Milestone 1"
07:03:48.764 STDOUT [repository] tofu:           + due_date    = "2025-09-01"
07:03:48.764 STDOUT [repository] tofu:           + number      = (known after apply)
07:03:48.764 STDOUT [repository] tofu:           + repository  = "infra-modules"
07:03:48.764 STDOUT [repository] tofu:           + state       = "open"
07:03:48.764 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"
07:03:48.764 STDOUT [repository] tofu:         }
07:03:48.764 STDOUT [repository] tofu:     }
07:03:48.764 STDOUT [repository] tofu:   + repositories  = {
07:03:48.764 STDOUT [repository] tofu:       + ".github"         = {
07:03:48.764 STDOUT [repository] tofu:           + description    = "Organization-wide GitHub configurations, workflows, and community templates"
07:03:48.764 STDOUT [repository] tofu:           + full_name      = (known after apply)
07:03:48.764 STDOUT [repository] tofu:           + html_url       = (known after apply)
07:03:48.764 STDOUT [repository] tofu:           + http_clone_url = (known after apply)
07:03:48.764 STDOUT [repository] tofu:           + id             = (known after apply)
07:03:48.764 STDOUT [repository] tofu:           + name           = ".github"
07:03:48.764 STDOUT [repository] tofu:           + node_id        = (known after apply)
07:03:48.764 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)
07:03:48.765 STDOUT [repository] tofu:           + topics         = [
07:03:48.765 STDOUT [repository] tofu:               + "automation",
07:03:48.765 STDOUT [repository] tofu:               + "community",
07:03:48.765 STDOUT [repository] tofu:               + "github",
07:03:48.765 STDOUT [repository] tofu:               + "templates",
07:03:48.765 STDOUT [repository] tofu:               + "workflows",
07:03:48.765 STDOUT [repository] tofu:             ]
07:03:48.765 STDOUT [repository] tofu:           + visibility     = "public"
07:03:48.765 STDOUT [repository] tofu:         }
07:03:48.765 STDOUT [repository] tofu:       + github-management = {
07:03:48.765 STDOUT [repository] tofu:           + description    = "Infrastructure as Code for GitHub organization, repositories, and security management"
07:03:48.765 STDOUT [repository] tofu:           + full_name      = (known after apply)
07:03:48.765 STDOUT [repository] tofu:           + html_url       = (known after apply)
07:03:48.765 STDOUT [repository] tofu:           + http_clone_url = (known after apply)
07:03:48.765 STDOUT [repository] tofu:           + id             = (known after apply)
07:03:48.765 STDOUT [repository] tofu:           + name           = "github-management"
07:03:48.765 STDOUT [repository] tofu:           + node_id        = (known after apply)
07:03:48.765 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)
07:03:48.765 STDOUT [repository] tofu:           + topics         = [
07:03:48.765 STDOUT [repository] tofu:               + "automation",
07:03:48.765 STDOUT [repository] tofu:               + "github",
07:03:48.765 STDOUT [repository] tofu:               + "infrastructure",
07:03:48.765 STDOUT [repository] tofu:               + "security",
07:03:48.765 STDOUT [repository] tofu:               + "terraform",
07:03:48.765 STDOUT [repository] tofu:             ]
07:03:48.765 STDOUT [repository] tofu:           + visibility     = "public"
07:03:48.765 STDOUT [repository] tofu:         }
07:03:48.765 STDOUT [repository] tofu:       + gitops            = {
07:03:48.765 STDOUT [repository] tofu:           + description    = "GitOps repository for Kubernetes application deployments using ArgoCD and Helm"
07:03:48.765 STDOUT [repository] tofu:           + full_name      = (known after apply)
07:03:48.765 STDOUT [repository] tofu:           + html_url       = (known after apply)
07:03:48.765 STDOUT [repository] tofu:           + http_clone_url = (known after apply)
07:03:48.765 STDOUT [repository] tofu:           + id             = (known after apply)
07:03:48.765 STDOUT [repository] tofu:           + name           = "gitops"
07:03:48.765 STDOUT [repository] tofu:           + node_id        = (known after apply)
07:03:48.765 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)
07:03:48.765 STDOUT [repository] tofu:           + topics         = [
07:03:48.765 STDOUT [repository] tofu:               + "argocd",
07:03:48.765 STDOUT [repository] tofu:               + "deployments",
07:03:48.765 STDOUT [repository] tofu:               + "gitops",
07:03:48.765 STDOUT [repository] tofu:               + "helm",
07:03:48.765 STDOUT [repository] tofu:               + "kubernetes",
07:03:48.766 STDOUT [repository] tofu:             ]
07:03:48.766 STDOUT [repository] tofu:           + visibility     = "public"
07:03:48.766 STDOUT [repository] tofu:         }
07:03:48.766 STDOUT [repository] tofu:       + infra-live        = {
07:03:48.766 STDOUT [repository] tofu:           + description    = "Live infrastructure configurations managed with Terragrunt for environment-specific deployments"
07:03:48.766 STDOUT [repository] tofu:           + full_name      = (known after apply)
07:03:48.766 STDOUT [repository] tofu:           + html_url       = (known after apply)
07:03:48.766 STDOUT [repository] tofu:           + http_clone_url = (known after apply)
07:03:48.766 STDOUT [repository] tofu:           + id             = (known after apply)
07:03:48.766 STDOUT [repository] tofu:           + name           = "infra-live"
07:03:48.766 STDOUT [repository] tofu:           + node_id        = (known after apply)
07:03:48.766 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)
07:03:48.766 STDOUT [repository] tofu:           + topics         = [
07:03:48.766 STDOUT [repository] tofu:               + "environments",
07:03:48.766 STDOUT [repository] tofu:               + "infrastructure",
07:03:48.766 STDOUT [repository] tofu:               + "production",
07:03:48.766 STDOUT [repository] tofu:               + "terraform",
07:03:48.766 STDOUT [repository] tofu:               + "terragrunt",
07:03:48.766 STDOUT [repository] tofu:             ]
07:03:48.766 STDOUT [repository] tofu:           + visibility     = "public"
07:03:48.766 STDOUT [repository] tofu:         }
07:03:48.766 STDOUT [repository] tofu:       + infra-modules     = {
07:03:48.766 STDOUT [repository] tofu:           + description    = "Reusable Terraform modules for cloud infrastructure and Kubernetes platform components"
07:03:48.766 STDOUT [repository] tofu:           + full_name      = (known after apply)
07:03:48.766 STDOUT [repository] tofu:           + html_url       = (known after apply)
07:03:48.766 STDOUT [repository] tofu:           + http_clone_url = (known after apply)
07:03:48.766 STDOUT [repository] tofu:           + id             = (known after apply)
07:03:48.766 STDOUT [repository] tofu:           + name           = "infra-modules"
07:03:48.766 STDOUT [repository] tofu:           + node_id        = (known after apply)
07:03:48.766 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)
07:03:48.766 STDOUT [repository] tofu:           + topics         = [
07:03:48.766 STDOUT [repository] tofu:               + "cloud",
07:03:48.766 STDOUT [repository] tofu:               + "infrastructure",
07:03:48.766 STDOUT [repository] tofu:               + "kubernetes",
07:03:48.766 STDOUT [repository] tofu:               + "modules",
07:03:48.766 STDOUT [repository] tofu:               + "terraform",
07:03:48.767 STDOUT [repository] tofu:             ]
07:03:48.767 STDOUT [repository] tofu:           + visibility     = "public"
07:03:48.767 STDOUT [repository] tofu:         }
07:03:48.767 STDOUT [repository] tofu:     }
07:03:48.781 WARN   [repository] Config ./membership/terragrunt.hcl is a dependency of ./repository/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
07:03:48.783 WARN   [organization] Config ./membership/terragrunt.hcl is a dependency of ./organization/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
07:03:48.828 WARN   [organization] Config ./repository/terragrunt.hcl is a dependency of ./organization/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
07:03:49.144 STDOUT [organization] tofu: OpenTofu used the selected providers to generate the following execution
07:03:49.144 STDOUT [organization] tofu: plan. Resource actions are indicated with the following symbols:
07:03:49.144 STDOUT [organization] tofu:   + create
07:03:49.144 STDOUT [organization] tofu: OpenTofu will perform the following actions:
07:03:49.145 STDOUT [organization] tofu:   # github_organization_security_manager.security_manager_team will be created
07:03:49.145 STDOUT [organization] tofu:   + resource "github_organization_security_manager" "security_manager_team" {
07:03:49.145 STDOUT [organization] tofu:       + id        = (known after apply)
07:03:49.145 STDOUT [organization] tofu:       + team_slug = "admin"
07:03:49.145 STDOUT [organization] tofu:     }
07:03:49.145 STDOUT [organization] tofu:   # github_organization_settings.main will be created
07:03:49.145 STDOUT [organization] tofu:   + resource "github_organization_settings" "main" {
07:03:49.145 STDOUT [organization] tofu:       + advanced_security_enabled_for_new_repositories               = true
07:03:49.145 STDOUT [organization] tofu:       + billing_email                                                = "your-email@example.com"
07:03:49.145 STDOUT [organization] tofu:       + default_repository_permission                                = "read"
07:03:49.145 STDOUT [organization] tofu:       + dependabot_alerts_enabled_for_new_repositories               = true
07:03:49.145 STDOUT [organization] tofu:       + dependabot_security_updates_enabled_for_new_repositories     = true
07:03:49.145 STDOUT [organization] tofu:       + dependency_graph_enabled_for_new_repositories                = true
07:03:49.145 STDOUT [organization] tofu:       + description                                                  = "Github Organization Playground Example"
07:03:49.145 STDOUT [organization] tofu:       + has_organization_projects                                    = true
07:03:49.145 STDOUT [organization] tofu:       + has_repository_projects                                      = false
07:03:49.145 STDOUT [organization] tofu:       + id                                                           = (known after apply)
07:03:49.145 STDOUT [organization] tofu:       + members_can_create_internal_repositories                     = false
07:03:49.145 STDOUT [organization] tofu:       + members_can_create_pages                                     = false
07:03:49.145 STDOUT [organization] tofu:       + members_can_create_private_pages                             = false
07:03:49.146 STDOUT [organization] tofu:       + members_can_create_private_repositories                      = false
07:03:49.146 STDOUT [organization] tofu:       + members_can_create_public_pages                              = false
07:03:49.146 STDOUT [organization] tofu:       + members_can_create_public_repositories                       = false
07:03:49.146 STDOUT [organization] tofu:       + members_can_create_repositories                              = false
07:03:49.146 STDOUT [organization] tofu:       + members_can_fork_private_repositories                        = false
07:03:49.146 STDOUT [organization] tofu:       + name                                                         = "Example"
07:03:49.146 STDOUT [organization] tofu:       + secret_scanning_enabled_for_new_repositories                 = true
07:03:49.146 STDOUT [organization] tofu:       + secret_scanning_push_protection_enabled_for_new_repositories = true
07:03:49.146 STDOUT [organization] tofu:       + web_commit_signoff_required                                  = false
07:03:49.146 STDOUT [organization] tofu:     }
07:03:49.146 STDOUT [organization] tofu: Plan: 2 to add, 0 to change, 0 to destroy.
07:03:49.146 STDOUT [organization] tofu: Changes to Outputs:
07:03:49.146 STDOUT [organization] tofu:   + organization     = {
07:03:49.146 STDOUT [organization] tofu:       + advanced_security_enabled               = true
07:03:49.146 STDOUT [organization] tofu:       + billing_email                           = "your-email@example.com"
07:03:49.146 STDOUT [organization] tofu:       + blog                                    = null
07:03:49.146 STDOUT [organization] tofu:       + default_repository_permission           = "read"
07:03:49.146 STDOUT [organization] tofu:       + dependabot_alerts_enabled               = true
07:03:49.146 STDOUT [organization] tofu:       + dependabot_security_updates_enabled     = true
07:03:49.146 STDOUT [organization] tofu:       + dependency_graph_enabled                = true
07:03:49.146 STDOUT [organization] tofu:       + description                             = "Github Organization Playground Example"
07:03:49.147 STDOUT [organization] tofu:       + email                                   = null
07:03:49.147 STDOUT [organization] tofu:       + has_organization_projects               = true
07:03:49.147 STDOUT [organization] tofu:       + location                                = null
07:03:49.147 STDOUT [organization] tofu:       + name                                    = "Example"
07:03:49.147 STDOUT [organization] tofu:       + secret_scanning_enabled                 = true
07:03:49.147 STDOUT [organization] tofu:       + secret_scanning_push_protection_enabled = true
07:03:49.147 STDOUT [organization] tofu:       + web_commit_signoff_required             = false
07:03:49.147 STDOUT [organization] tofu:     }
07:03:49.147 STDOUT [organization] tofu:   + security_manager = {
07:03:49.147 STDOUT [organization] tofu:       + team_slug = "admin"
07:03:49.147 STDOUT [organization] tofu:     }
```

</details>
    
